Repository: lepidus/OASwitchboard
Catalog: locale/*/locale.po
Languages: es_es, pt_br

# plugins.generic.OASwitchboard.displayName
source: OA Switchboard Plugin
es_es: Módulo de OA Switchboard
pt_br: Plugin OA Switchboard

# plugins.generic.OASwitchboard.settings.apiKeySecretMissing
source: Your OJS is missing a security setting ('api_key_secret'). You may contact your system administrator to set it up in the config file.
es_es: A su OJS le falta una configuración de seguridad ('api_key_secret'). Puede ponerse en contacto con su administrador del sistema para configurarlo en el archivo de configuración.
pt_br: Seu OJS está sem uma configuração de segurança ('api_key_secret'). Você pode contactar o administrador do sistema para defini-la no arquivo de configuração.

# plugins.generic.OASwitchboard.settings.apiKeySecretInfomration
source: The 'api_key_secret' is use to safely store your OA Switchboard credentials.<br>More information on how to set it up can be found in <a href="https://forum.pkp.sfu.ca/t/how-to-generate-a-api-key-secret-code-in-ojs-3/72008/" target="_blank">this PKP Community Forum thread</a>.<br><br>Once it's set up, come back here to enter your credentials.
es_es: El 'api_key_secret' se utiliza para almacenar de forma segura sus credenciales de OA Switchboard.<br>Más información sobre cómo configurarlo se puede encontrar en este <a href="https://forum.pkp.sfu.ca/t/how-to-generate-a-api-key-secret-code-in-ojs-3/72008/" target="_blank">tema del Foro de la Comunidad PKP</a>.<br><br>Una vez configurado, vuelva aquí para introducir sus credenciales.
pt_br: A configuração api_key_secret é usada para armazenar suas credenciais do OA Switchboard com segurança. Mais informações sobre como configurá-la podem ser encontradas <a href="https://forum.pkp.sfu.ca/t/how-to-generate-a-api-key-secret-code-in-ojs-3/72008/" target="_blank">neste tópico do Fórum da Comunidade PKP</a>.

# plugins.generic.OASwitchboard.settings.issnMissing
source: Until an ISSN or eISSN is assigned to the journal, the OA Switchboard plugin will not be able to send messages.
es_es: Hasta que se asigne un ISSN o eISSN a la revista, el módulo de OA Switchboard no podrá enviar mensajes.
pt_br: Até que um ISSN ou eISSN seja atribuído à revista, o plugin OA Switchboard não poderá enviar mensagens.

# plugins.generic.OASwitchboard.description
source: Allows sending messages to OA Switchboard, automatically, at the publication of an article.
es_es: Permite enviar mensajes a OA Switchboard, de forma automática, al momento de la publicación de un artículo.
pt_br: Permite o envio de mensagens para a OA Switchboard, de forma automática, no momento da publicação de um artigo.

# plugins.generic.OASwitchboard.settings.description
source: Please, enter your Open Access Switchboard credentials below, to allow the plugin to access the API.
es_es: Por favor, ingrese sus credenciales de OA Switchboard a continuación, para permitir que el complemento acceda a la API de Open Access Switchboard.
pt_br: Por favor, insira suas credenciais do Open Access Switchboard, para permitir que o plugin acesse a API.

# plugins.generic.OASwitchboard.settings.useApiForTests
source: Use API for tests
es_es: Utilizar API para pruebas
pt_br: Usar API para testes

# plugins.generic.OASwitchboard.settings.useApiForTests.option.label
source: Use sandbox API for plugin testing purposes.
es_es: Utilizar API sandbox para pruebas del módulo.
pt_br: Usar API Sandbox para fins de testes do plugin.

# plugins.generic.OASwitchboard.settings.description.hasCredentials
source: The API credentials are ready to use! Currently using credentials for: <strong>{$username}</strong>.<br>You can edit the credentials below, or click the Cancel button.
es_es: ¡Las credenciales API están listas para usar! Actualmente usando credenciales para: <strong>{$username}</strong>.<br>Puede editar las credenciales a continuación o hacer clic en el botón Cancelar.
pt_br: As credenciais da API estão prontas para uso! Atualmente usando credenciais para: <strong>{$username}</strong>.<br>Você pode editar as credenciais abaixo ou clicar no botão Cancelar.

# plugins.generic.OASwitchboard.settings.username
source: Username:
es_es: Nombre de usuario:
pt_br: Nome de usuário:

# plugins.generic.OASwitchboard.settings.password
source: Password:
es_es: Contraseña:
pt_br: Senha:

# plugins.generic.OASwitchboard.settings.apiAuthenticatorFailed
source: Authentication failed, please check the OA Switchboard API credentials.
es_es: No se pudo autenticar, por favor, verifique las credenciales de la API de OA Switchboard.
pt_br: Não foi possível autenticar, por favor, verifique as credenciais da API OA Switchboard

# plugins.generic.OASwitchboard.pluginIsNotConfigured
source: The OA Switchboard plugin is not configured.
es_es: El plugin OA Switchboard no está configurado.
pt_br: O plugin OA Switchboard não foi configurado.

# plugins.generic.OASwitchboard.sendMessageWithSuccess
source: The P1 message was successfully sent to the OA Switchboard.
es_es: El mensaje P1 fue enviado con éxito al OA Switchboard.
pt_br: A mensagem P1 foi enviada com sucesso para o OA Switchboard

# plugins.generic.OASwitchboard.postRequirements
source: Error while attempting to send message via OA Switchboard API. More information can be found in the server logs.
es_es: Error al intentar enviar un mensaje a través de la API de OA Switchboard. Puede encontrar más información en los registros del servidor.
pt_br: Erro ao tentar enviar mensagem via API OA Switchboard. Pode-se obter mais informações nos logs do servidor.

# plugins.generic.OASwitchboard.serverError
source: Error sending the message. The OA Switchboard API returned an internal server error.
es_es: Error al enviar el mensaje. La API de OA Switchboard devolvió un error interno.
pt_br: Erro ao enviar a mensagem. A API do OA Switchboard retornou um erro interno.

# plugins.generic.OASwitchboard.rorRecommendation
source: It is recommended that at least one author has a ROR ID linked to their affiliation (requires the ROR plugin) to send the message to the author's institution.
es_es: Se recomienda que al menos un autor tenga un ID ROR vinculado a su afiliación (requiere el plugin ROR) para enviar el mensaje a la institución del autor.
pt_br: É recomendado que pelo menos um autor tenha um ID ROR vinculado à sua afiliação (requer o plugin ROR) para que a mensagem seja enviada à instituição do autor.

# plugins.generic.OASwitchboard.postRequirementsError.introductionText
source: it will not be possible to send the P1 message as the submission does not meet the following requirements.
es_es: no será posible enviar el mensaje P1, ya que la presentación no cumple con los requisitos a continuación.
pt_br: OA Switchboard: não será possível enviar a mensagem P1, pois a submissão não cumpre os requisitos abaixo.

# plugins.generic.OASwitchboard.postRequirementsError.familyName
source: The family name of all authors must be present.
es_es: El apellido de todos los autores debe estar presente.
pt_br: O sobrenome de todos os autores precisam estar presentes.

# plugins.generic.OASwitchboard.postRequirementsError.affiliation
source: All authors must have their affiliation filled in.
es_es: Todos los autores deben tener su afiliación completada.
pt_br: Todos os autores precisam ter afiliação preenchida.

# plugins.generic.OASwitchboard.postRequirementsError.doi
source: The article must have an associated DOI.
es_es: El artículo debe tener un DOI asociado.
pt_br: O artigo precisa ter um DOI associado.

# plugins.generic.OASwitchboard.postRequirementsError.issn
source: The journal must have an assigned ISSN.
es_es: La revista debe tener un ISSN asignado.
pt_br: A revista precisa ter um ISSN atribuído.

# plugins.generic.OASwitchboard.postRequirementsError.conclusionText
source: You may review these metadata, or proceed with the publication without sending the message to the OA Switchboard.
es_es: Puede revisar estos metadatos o continuar con la publicación sin enviar el mensaje al OA Switchboard.
pt_br: Você pode rever estes metadados, ou continuar com a publicação sem o envio da mensagem para o OA Switchboard.

# plugins.generic.OASwitchboard.postRequirementsSuccess
source: the requirements have been met and the P1 message will be sent to the OA Switchboard upon publishing the submission.
es_es: se han cumplido los requisitos y el mensaje P1 será enviado al OA Switchboard al publicar la publicacíon.
pt_br: OA Switchboard: os requisitos foram atendidos e a mensagem P1 será enviada ao OA Switchboard ao publicar a submissão.

# plugins.generic.OASwitchboard.workflowTab.title
source: Status of message sent to OA Switchboard
es_es: Estado del Envío del Mensaje al OA Switchboard
pt_br: Situação do envio da mensagem para o OA Switchboard
